[
  {
    "to": [
      "tobilobaayodele23@gmail.com"
    ],
    "to_name": "Paystack",
    "subject": "Voice support for Nigerian customers",
    "company": "Paystack",
    "body": "Hi team Paystack,\n\nI'm reaching out because I've built a multilingual voice agent that helps fintechs like yours automate customer support in local languages. I saw that Paystack helps businesses in Africa get paid by anyone, anywhere in the world - this means you likely deal with a wide range of customers who speak different languages.\n\nBy using our voice agent, you can provide support to customers in Pidgin, Yoruba, Igbo, and Hausa, reducing the need for human agents to handle routine inquiries. This can help you save time and money on support costs, similar to how we've helped other payment platforms reduce their support costs by 60%. Additionally, our voice agent can help resolve disputes and provide real-time transaction clarity, improving the overall customer experience and potentially increasing transaction volumes.\n\nWould a quick call next week be worth exploring how our voice agent can help Paystack improve customer support and reduce costs?"
  },
  {
    "to": [
      "tobilobaayodele23@gmail.com"
    ],
    "to_name": "Termii",
    "subject": "Voice support for Nigerian customers",
    "company": "Termii",
    "body": "Hi team Termii,\n\nI'm reaching out because I've built a multilingual voice agent that helps fintechs automate customer support in local languages like Pidgin, Yoruba, Igbo, and Hausa. I saw that you're focused on seamless communication that empowers businesses and connects people globally.\n\nYour goal of connecting people across the globe resonates with me, especially in regions where language barriers can hinder communication. For instance, our voice agent can help resolve disputes and provide real-time transaction clarity in local languages, reducing the need for human agents and saving time. By automating support in these languages, you can reduce support costs by up to 60% and improve customer satisfaction. Additionally, our voice agent can handle a high volume of customer inquiries, freeing up your team to focus on more complex issues.\n\nWould you be open to a quick call to discuss how our voice agent can help Termii enhance customer experience and reduce support costs in the Nigerian market?"
  }
]